# Pandas

- its a python library used for working with datas
- it provides easy to use data structure 
- helps cleaning,manipulation and analysis 
- can easily import datasets from csv,excel,json and sql
- there are two primary data structures in pandas **Series** & **Dataframe**
- **Series** -> 1D labeled homogeneous array
- **DataFrame** -> 2d labeled heterogeneous table

In [5]:
import pandas as pd

# Series
- 1D single column data
- homogeneus -> usually stores one data type
- size immputable -> once created, the number of elements cannot change, but the values can be updated
- labled -> each elements has an index, default range index

In [44]:
s1 = pd.Series([10,20,30,40,50]) # used for creating single column data

s1.dtype

dtype('int64')

In [45]:
s1.values # used for checking values of the series

array([10, 20, 30, 40, 50])

In [48]:
s1.index #gives the index lables

Index(['a', 'b', 'c', 'd', 'f'], dtype='object')

In [47]:
index = ['a','b','c','d','f']

s1.index = index # also can change the index lables

s1

a    10
b    20
c    30
d    40
f    50
dtype: int64

In [50]:
s1.keys() # gives the index numbers or custom lables

Index(['a', 'b', 'c', 'd', 'f'], dtype='object')

In [53]:
s1['a':'c'] # in lable baased indexing the start value as well as the stop value also includes in the output
# in normal indexing the stop value will exclude in the out put

a    10
b    20
c    30
dtype: int64

In [54]:
s1.iloc[0] # accesse by integer position only it ignore lables always looks at the numeric position

np.int64(10)

In [68]:
s1.loc['a'] # access by index lables work with default numbers or custom lables

np.int64(10)

In [66]:
# the default name will be None
s1.name = "numbers" # we can assign a new name using .name
print(s1.name)
print(s1)

numbers
a    10
b    20
c    30
d    40
f    50
Name: numbers, dtype: int64

In [72]:
# creating a Series out of a dictionary
dict1 = {
    "apple":27,
    "orange":21,
    "banana":30,
    "grape":25,
    "pineapple":20,
    "strawberry":32,
    "blueberry":45,
    "jackfruit":26,
    "lemon":12,
    "avocado":28
}

s2 = pd.Series(dict1, name="fruits") 
print(s2.name)
print(s2)

fruits
apple         27
orange        21
banana        30
grape         25
pineapple     20
strawberry    32
blueberry     45
jackfruit     26
lemon         12
avocado       28
Name: fruits, dtype: int64

In [73]:
s2.loc[['orange','apple','banana']]

orange    21
apple     27
banana    30
Name: fruits, dtype: int64

In [74]:
s2.iloc[1:4]

orange    21
banana    30
grape     25
Name: fruits, dtype: int64

In [80]:
s2.iloc[[9,8,7]]

avocado      28
lemon        12
jackfruit    26
Name: fruits, dtype: int64

In [81]:
print(s2.keys())
print(s2.values)

Index(['apple', 'orange', 'banana', 'grape', 'pineapple', 'strawberry',
       'blueberry', 'jackfruit', 'lemon', 'avocado'],
      dtype='object')
[27 21 30 25 20 32 45 26 12 28]

In [87]:
extract = s2[s2>=28] # filtering series values using a condition called conditional selection
extract

banana        30
strawberry    32
blueberry     45
avocado       28
Name: fruits, dtype: int64

In [92]:
[(s2>20) & (s2<30)] # we need both condition meets true to get the result true

[apple          True
 orange         True
 banana        False
 grape          True
 pineapple     False
 strawberry    False
 blueberry     False
 jackfruit      True
 lemon         False
 avocado        True
 Name: fruits, dtype: bool]

In [94]:
s2["grape"]=100 # this is how we can modify a series
s2

apple          27
orange         21
banana         30
grape         100
pineapple      20
strawberry     32
blueberry      45
jackfruit      26
lemon          12
avocado        28
Name: fruits, dtype: int64

# DataFrame
- 2D structure multiple rows and columns
- hetrogeneous -> each column can have multiple data types
- size mutable -> can remove or add rows and columns
- rows can have index numbers (can be customized) columns can have names/lables
- tabular structure -> data is organized as a table format

In [147]:
import numpy as np

data = {
    "name":["jishnu","anusree","vishnu","abi"],
    "age":[26,26,16,np.nan],
    "department":["HR","sales","student","intern"],
    "sallery":[50000,25000,np.nan,10000]
}

df = pd.DataFrame(data)
df.index = ['a','b','c','d']
df

      name   age department  sallery
a   jishnu  26.0         HR  50000.0
b  anusree  26.0      sales  25000.0
c   vishnu  16.0    student      NaN
d      abi   NaN     intern  10000.0

In [128]:
df.head(2) # to quickly view first few rows (works both in data frame and series)

      name   age department  sallery
a   jishnu  26.0         HR  50000.0
b  anusree  26.0      sales  25000.0

In [129]:
df.tail(3) # to quickly view last few rows (works both in data frame and sseries)

      name   age department  sallery
b  anusree  26.0      sales  25000.0
c   vishnu  16.0    student      NaN
d      abi   NaN     intern  10000.0

In [131]:
df.loc['a':'c' ,["department","sallery"]] # [rows , labeled indexing]

  department  sallery
a         HR  50000.0
b      sales  25000.0
c    student      NaN

In [132]:
df.iloc[2:4,1:3] # [rows,columns] in numerical indexing

    age department
c  16.0    student
d   NaN     intern

In [133]:
df["department"]

a         HR
b      sales
c    student
d     intern
Name: department, dtype: object

In [146]:
df

      name   age department  sallery
a   jishnu  26.0         HR  50000.0
b  anusree  26.0      sales  25000.0
d      abi   NaN     intern  10000.0

In [150]:
df.drop('c',inplace=False) # used to remove rows or columns using lable (lable,axis,inplase = False by default 
# when inplace make True manually it will remove the entire row or column permenently

      name   age department  sallery
a   jishnu  26.0         HR  50000.0
b  anusree  26.0      sales  25000.0
d      abi   NaN     intern  10000.0

In [162]:
df

      name   age department  sallery
a   jishnu  26.0         HR  50000.0
b  anusree  26.0      sales  25000.0
c   vishnu  16.0    student      NaN
d      abi   NaN     intern  10000.0

In [167]:
df.loc['c','sallery']

np.float64(30000.0)

In [169]:
df

      name   age department  sallery
a   jishnu  26.0         HR  50000.0
b  anusree  26.0      sales  25000.0
c   vishnu  16.0    student  30000.0
d      abi   NaN     intern  10000.0